Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES - Copy/01.Source/rl78i1c/application/scheduler/r_scheduler.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability 
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2013, 2016 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : r_scheduler.c
* Version      : <Version>
* Device(s)    : <'RL78/I1C'>
* Tool-Chain   : <'CCRL'>
* H/W Platform : <'RL78/I1C Energy Meter Platform'>
* Description  : <Description of file>
************************************************************************************************************************
* History      : DD.MM.YYYY Version Description
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Drivers */
#include "r_cg_macrodriver.h"

/* EM */
#include "em_type.h"

/* Meter application */
#include "platform.h"
#include "r_scheduler.h"
#include "inst_read.h"
#include "r_meter_format.h"

/* Standard library */
#include <string.h>
#include "storage.h"
/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

#define LCD_DELAY_TIME                                  (5)      /* Create delay time 5s */

/* Compute total minutes passed in a day */
#define TOTAL_MIN_PASSED_IN_DAY(hour, min)              (((uint16_t)hour * 60) + (min))
#define TOTAL_MIN_OFFSET_IN_DAY(hour, min)              (((uint16_t)hour * 60) + (min))

#if 1
    /* Get element from rtc_counter_value_t */
    #define GET_HOUR(p_rtc)         ((p_rtc)->hour)
    #define GET_MIN(p_rtc)          ((p_rtc)->min)
    #define GET_SEC(p_rtc)          ((p_rtc)->sec)
    #define GET_YEAR(p_rtc)         ((p_rtc)->year)
    #define GET_MONTH(p_rtc)        ((p_rtc)->month)
    #define GET_DAY(p_rtc)          ((p_rtc)->day)
    #define GET_WEEK(p_rtc)         ((p_rtc)->week)
#else
    #define GET_HOUR(p_rtc)         ((p_rtc)->rhrcnt)
    #define GET_MIN(p_rtc)          ((p_rtc)->rmincnt)
    #define GET_SEC(p_rtc)          ((p_rtc)->rseccnt)
    #define GET_YEAR(p_rtc)         ((p_rtc)->ryrcnt)
    #define GET_MONTH(p_rtc)        ((p_rtc)->rmtcnt)
    #define GET_DAY(p_rtc)          ((p_rtc)->rdaycnt)
    #define GET_WEEK(p_rtc)         ((p_rtc)->rwkcnt)
#endif

#define COPY_BACKUP_DATA(var1, var2)    {  \
                                            (var1).matched            = (var2).matched;    \
                                            (var1).number_of_exe_time = (var2).number_of_exe_time; \
                                            (var1).script_id          = (var2).script_id;  \
                                        }

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

const uint16_t g_exe_time_base_index[] = {
	START_SLOT_EXE_TIME_0,
	START_SLOT_EXE_TIME_1,
	START_SLOT_EXE_TIME_2,
	START_SLOT_EXE_TIME_3,
	START_SLOT_EXE_TIME_4,
	START_SLOT_EXE_TIME_5,
	START_SLOT_EXE_TIME_6	
};

const uint16_t scheduler_exe_time_maximum_support[] = {
	SCHEDULE_EXE_TIME_MAX_SUPPORT_0,
	SCHEDULE_EXE_TIME_MAX_SUPPORT_1,
	SCHEDULE_EXE_TIME_MAX_SUPPORT_2,
	SCHEDULE_EXE_TIME_MAX_SUPPORT_3,
	SCHEDULE_EXE_TIME_MAX_SUPPORT_4,
	SCHEDULE_EXE_TIME_MAX_SUPPORT_5,
	SCHEDULE_EXE_TIME_MAX_SUPPORT_6	
};

/***********************************************************************************************************************
Imported global variables and functions (from other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables and functions (to be accessed by other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

r_scheduler_flags_t g_scheduler_flags;

uint16_t g_demand_integration_period = SCHEDULER_DEFAULT_MAX_DEMAND_PERIOD;                  /* Max demand time of an intergration period. Unit: Minute */
const uint16_t g_fixed_interval_period = 15;                                                 /* Block load period.                         Unit: Minute */

/* Setting: sliding demand (>1, max 15) or block demand (=1) */
uint16_t g_demand_number_of_period = SCHEDULER_DEFAULT_MAX_DEMAND_NUM_OF_PERIOD;

