Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES - Copy/01.Source/rl78i1c/application/scheduler/r_scheduler.c
r_scheduler_datetime_t g_scheduler_exe_time[SCHEDULE_EXECUTION_TIME_MAX_SUPPORT];

scheduler_match_context_t g_scheduler_match_context[MAX_SCHEDULER_NUMBER];

scheduler_t	g_scheduler[MAX_SCHEDULER_NUMBER] = 
{
  /* Matched, Number of scheduler time        , Script ID,   Scheduler datetime      */
    {  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_0 ,    1 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_0]         },
    {  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_1 ,    2 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_1]         },
    {  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_2 ,    3 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_2]         },
    {  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_3 ,    4 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_3]         },
    {  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_4 ,    5 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_4]         },
    {  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_5 ,    6 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_5]         },
	{  FALSE, SCHEDULE_EXE_TIME_MAX_SUPPORT_6 ,    7 ,    &g_scheduler_exe_time[START_SLOT_EXE_TIME_6]         }
};

static uint16_t g_lcd_display_count = 0;

const r_scheduler_datetime_t billing_schedule_default = {00, 00, 00, 1, 0xFF, 0xFF, 0xFF, 0xFF};
const r_scheduler_datetime_t common_schedule_default = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
const r_scheduler_datetime_t tariff_exe_time_default[] =
{
	/* {Sec, Min, Hour, Day, Week, Month, Year, Reserved} */
	/* Default tariff slot 1 */
	{0x00, 0x00, 0x00, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 2 */
	{0x00, 0x00, 0x03, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 3 */
	{0x00, 0x00, 0x06, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 4 */
	{0x00, 0x00, 0x09, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 5 */
	{0x00, 0x00, 0x0C, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 6 */
	{0x00, 0x00, 0x0F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 7 */
	{0x00, 0x00, 0x12, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
	/* Default tariff slot 8 */
	{0x00, 0x00, 0x15, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
};


/******************************************************************************
* Function Name: SCHEDULER_IsMDMPeriodChanged
* Description  : Scheduler checking Max Demand Period Is Changed Or Not
* Arguments    : rtc_counter_value_t *p_rtctime: RTC time from snapshot
* Return Value : uint8_t
*              :        1. Changed
*              :        0. No change
******************************************************************************/
static uint8_t SCHEDULER_IsMDMPeriodChanged(rtc_counter_value_t *p_rtctime)
{
    uint8_t     bChanged = 0;   /* Default is no change */
    uint16_t    rtc_time_frame, schedule_time_frame;

    if ( GET_SEC(p_rtctime) == 0 &&
         (GET_HOUR(p_rtctime) * 60 + GET_MIN(p_rtctime) ) % g_demand_integration_period == 0)
    {
        return TRUE;
    }
    else
    {
        return FALSE;
    }
}

/******************************************************************************
* Function Name: static uint8_t ENERGY_BLOCKLOAD_IsPeriodChanged(rtc_counter_value_t *rtctime)
* Description  : Scheduler checking Block load Is Changed Or Not           
* Arguments    : rtc_counter_value_t *rtctime: RTC time from driver
* Return Value : uint8_t: period change status. 
*                               0: No change
*                               1: Change
******************************************************************************/
static uint8_t SCHEDULER_IsBlockloadPeriodChanged(rtc_counter_value_t *p_rtctime)
{
    if ( GET_SEC(p_rtctime) == 0 &&
         (GET_HOUR(p_rtctime) * 60 + GET_MIN(p_rtctime) ) % g_fixed_interval_period == 0)
    {
        return TRUE;
    }
    else
    {
        return FALSE;
    }
}

/******************************************************************************
* Function Name: static uint8_t SCHEDULER_IsDailyLoadPeriodChanged(rtc_counter_value_t *rtctime)
* Description  : Scheduler checking daily load           
* Arguments    : rtc_counter_value_t *rtctime: RTC time from driver
* Return Value : uint8_t: period change status. 
*                               0: No change
*                               1: Change
******************************************************************************/
static uint8_t SCHEDULER_IsDailyLoadPeriodChanged(rtc_counter_value_t *p_rtctime)
{
    if ( GET_SEC(p_rtctime) == 0  &&
         GET_MIN(p_rtctime) == 0  &&
         GET_HOUR(p_rtctime) == 0
        )
    {
        return TRUE;
    }
    else
    {
        return FALSE;
    }
}



uint8_t GetNumberDaysOfMonth(rtc_counter_value_t *p_rtc_value);
/******************************************************************************
* Function Name : GetNumberDaysOfMonth
* Interface     : uint8_t GetNumberDaysOfMonth(rtc_counter_value_t *p_rtc_value)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t GetNumberDaysOfMonth(rtc_counter_value_t *p_rtc_value)
{
    uint8_t	days = 0;	

    const uint8_t day_of_months[12] =
	{
		31,	/* Jan */
		28,	/* Feb, +1 if leap year */
		31,	/* Mar */
		30,	/* Apr */
		31,	/* May */
		30,	/* Jun */
		31,	/* Jul */
		31,	/* Aug */
		30,	/* Sep */
		31,	/* Oct */
		30,	/* Nov */
		31	/* Dec */
	};

    /*
	 * Get days of current month to check wildcard value 0xFD (2nd last day of month), 0xFE (last day of month)
	 * Leap year is checked as guideline from Microsoft for Excel.
	 * https://docs.microsoft.com/en-us/office/troubleshoot/excel/determine-a-leap-year
	 */
	if (p_rtc_value->month > 0 && p_rtc_value->month < 13)
	{
		days = day_of_months[p_rtc_value->month - 1];
		if (p_rtc_value->month == 2)
		{
			if (p_rtc_value->year % 400 == 0 || ((p_rtc_value->year % 4 == 0) && (p_rtc_value->year % 100 != 0)))
			{
				days++;				
			}
		}
	}

    return days;
}

/******************************************************************************
* Function Name : R_SCHEDULER_CalendarCheck
* Interface     : void R_SCHEDULER_CalendarCheck(rtc_counter_value_t *p_rtcvalue)
* Description   : 
* Arguments     : rtc_counter_value_t *p_rtcvalue: RTC value from snapshot (BCD format)
* Return Value  : None
******************************************************************************/
void R_SCHEDULER_CalendarCheck(rtc_counter_value_t *p_rtcvalue)
{
	uint8_t	i,j;
    uint8_t number_days_of_month;
	
	/* Turn 'matched' bit to TRUE if hit schedule */
	for (i = 0; i < MAX_SCHEDULER_NUMBER; i++)
	{
		if (g_scheduler[i].matched != TRUE)
		{
            for(j = 0; j < g_scheduler[i].number_of_exe_time; j++)
            {
                if (g_scheduler[i].p_execution_time[j].Sec   == 0xFF &&
                    g_scheduler[i].p_execution_time[j].Min   == 0xFF &&
                    g_scheduler[i].p_execution_time[j].Hour  == 0xFF &&
                    g_scheduler[i].p_execution_time[j].Day   == 0xFF &&
                    g_scheduler[i].p_execution_time[j].Week  == 0xFF &&
                    g_scheduler[i].p_execution_time[j].Month == 0xFF &&
                    g_scheduler[i].p_execution_time[j].Year  == 0xFF)
                {
                    continue;
                }

                if ((g_scheduler[i].p_execution_time[j].Sec   != 0xFF && g_scheduler[i].p_execution_time[j].Sec   != GET_SEC(p_rtcvalue)   ) ||
                    (g_scheduler[i].p_execution_time[j].Min   != 0xFF && g_scheduler[i].p_execution_time[j].Min   != GET_MIN(p_rtcvalue)   ) ||
                    (g_scheduler[i].p_execution_time[j].Hour  != 0xFF && g_scheduler[i].p_execution_time[j].Hour  != GET_HOUR(p_rtcvalue)  ) ||
                    (g_scheduler[i].p_execution_time[j].Week  != 0xFF && g_scheduler[i].p_execution_time[j].Week  != GET_WEEK(p_rtcvalue)  ) ||
                    (g_scheduler[i].p_execution_time[j].Month != 0xFF && g_scheduler[i].p_execution_time[j].Month != GET_MONTH(p_rtcvalue) ) ||
                    (g_scheduler[i].p_execution_time[j].Year  != 0xFF && g_scheduler[i].p_execution_time[j].Year  != GET_YEAR(p_rtcvalue) ) )
                {
                    continue;
                }
                
                if (g_scheduler[i].p_execution_time[j].Day != 0xFF)
                {
                    number_days_of_month = GetNumberDaysOfMonth(p_rtcvalue);

                    /* 2nd last day of month */
                    if (g_scheduler[i].p_execution_time[j].Day == 0xFD) {
                        if (GET_DAY(p_rtcvalue) != number_days_of_month - 1) {
                            continue;
                        }
                    }
                    /* last day of month */
                    else if (g_scheduler[i].p_execution_time[j].Day == 0xFE) {
                        if (GET_DAY(p_rtcvalue) != number_days_of_month) {
                            continue;
                        }
                    }
                    else if (g_scheduler[i].p_execution_time[j].Day != GET_DAY(p_rtcvalue)) {
                        continue;
                    }
                }

                g_scheduler[i].matched = TRUE;
                g_scheduler_match_context[i].exe_time_id = j;
                g_scheduler_match_context[i].p_snapshot = gp_inst_DataPop;
            }
		}
	}
}

void R_SCHEDULER_PollingProcessing(void);
/******************************************************************************
* Function Name : R_SCHEDULER_PollingProcessing
* Interface     : void R_SCHEDULER_PollingProcessing(void)
* Description   :
*                    Scheduler flags for TOU.
*                    Scheduler flags for Load Survey.
*                    Scheduler flags for Max Demand.
*                    Scheduler flags for LCD Display.
*                    Scheduler flags for Relay Ctrl.
*                    Scheduler flags for PUSH.
* Arguments     :
* Return Value  : void
******************************************************************************/
void R_SCHEDULER_PollingProcessing(void)
{
    s_capture_em_data_t *p_inst_DataPop;
    rtc_counter_value_t rtc_counters;

    p_inst_DataPop = R_INST_DataPop();

    if (p_inst_DataPop != NULL)       /* Have snapshot? */
    {
        memcpy(&rtc_counters, &p_inst_DataPop->capture_time, sizeof(rtc_counter_value_t));

        /* Check scheduler for MDM. If MDM period is end, set the corresponding flag to TRUE (1) */
        if (g_scheduler_flags.mdm == 0) {
            if (SCHEDULER_IsMDMPeriodChanged(&rtc_counters) == 1) {
                g_scheduler_flags.mdm = 1;
            }
        }

        /* Check scheduler for block load. If block load period is end, set the corresponding flag to TRUE (1) */
        if (g_scheduler_flags.blockload == 0) {
            if (SCHEDULER_IsBlockloadPeriodChanged(&rtc_counters) == 1) {
                /* Blockload changed */
                g_scheduler_flags.blockload = 1;
            }
        }

