Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES - Copy/01.Source/rl78i1c/application/scheduler/r_scheduler.c
        if (g_scheduler_flags.dailyload == 0)
        {
            if (SCHEDULER_IsDailyLoadPeriodChanged(&rtc_counters) == 1)
            {
                /* Dailyload changed */
                g_scheduler_flags.dailyload = 1;
            }
        }


        /* Scheduler for LCD Interval */
        g_scheduler_flags.lcd_refresh = TRUE;
        g_lcd_display_count++;
        if (g_lcd_display_count > (LCD_DELAY_TIME))
        {
            g_scheduler_flags.lcd_scroll = TRUE;
            g_lcd_display_count = 0;
        }

        /* Scheduler for FWU, PUSH and Billing */
        R_SCHEDULER_CalendarCheck(&rtc_counters);
        
    }

}

/******************************************************************************
* Function Name : R_SCHEDULER_Init
* Interface     : void R_SCHEDULER_Init(void)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void R_SCHEDULER_Init(void)
{
}

/******************************************************************************
* Function Name : R_SCHEDULER_Backup
* Interface     : uint8_t R_SCHEDULER_Backup(void)
* Description   : Backup for all scheduler data
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t	R_SCHEDULER_Backup(void)
{
	uint8_t i = 0;
	uint8_t j = 0;
    scheduler_storage_t schedule_backup;
	
	for (i = 0; i < MAX_SCHEDULER_NUMBER; i++)
	{
		/* Write data of scheduler to EEPROM */
        COPY_BACKUP_DATA(schedule_backup, g_scheduler[i]);

		EPR_Write(STORAGE_EEPROM_SCHEDULER_DATA_ADDR + i*SCHEDULER_STORAGE_SIZE, (uint8_t *)&schedule_backup, SCHEDULER_STORAGE_SIZE);
	}
	/* Write all execution time slots to EEPROM */
	EPR_Write(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR,
			 (uint8_t *)g_scheduler_exe_time,
			 STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_SIZE);
    /* Write demand period settings */
    EPR_Write(STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_ADDR, (uint8_t *)&g_demand_integration_period, sizeof(g_demand_integration_period));
    EPR_Write(STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_ADDR, (uint8_t *)&g_demand_number_of_period, sizeof(g_demand_number_of_period));
	return STORAGE_OK;
}

/******************************************************************************
* Function Name : R_SCHEDULER_BackupByID
* Interface     : uint8_t R_SCHEDULER_BackupByID(uint8_t schedule_id)
* Description   : Backup scheduler data by each ID
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t	R_SCHEDULER_BackupByID(uint8_t schedule_id)
{
    scheduler_storage_t schedule_backup;

	if (schedule_id >= MAX_SCHEDULER_NUMBER)
	{
		return STORAGE_ERROR;
	}
	else
	{
        COPY_BACKUP_DATA(schedule_backup, g_scheduler[schedule_id]);
		/* Write data of scheduler to EEPROM */
		EPR_Write(STORAGE_EEPROM_SCHEDULER_DATA_ADDR + schedule_id*SCHEDULER_STORAGE_SIZE, (uint8_t *)&schedule_backup, SCHEDULER_STORAGE_SIZE);

		/* Check pointer of execution time */	
		if(g_scheduler[schedule_id].p_execution_time == NULL)
		{
			return STORAGE_ERROR;
		}
		else
		{

		}
		/* Write execution time slots to EEPROM */		
		EPR_Write(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR + g_exe_time_base_index[schedule_id] * sizeof(r_scheduler_datetime_t),
				  (uint8_t *)g_scheduler[schedule_id].p_execution_time,
				  sizeof(r_scheduler_datetime_t) * scheduler_exe_time_maximum_support[schedule_id]);
		
		return STORAGE_OK;
	}
}


/******************************************************************************
* Function Name : R_SCHEDULER_Restore
* Interface     : uint8_t R_SCHEDULER_Restore(void)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t	R_SCHEDULER_Restore(void)
{
	uint8_t i = 0;
	uint8_t j = 0;
    scheduler_storage_t schedule_backup = { 0, 0, 0};
	
	for (i = 0; i < MAX_SCHEDULER_NUMBER; i++)
	{
		/* Read data of scheduler to EEPROM */
		EPR_Read(STORAGE_EEPROM_SCHEDULER_DATA_ADDR + i*SCHEDULER_STORAGE_SIZE, (uint8_t *)&schedule_backup, SCHEDULER_STORAGE_SIZE);
        COPY_BACKUP_DATA(g_scheduler[i], schedule_backup);
	}
	/* Read all execution time slots to EEPROM */
	EPR_Read(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR,
			 (uint8_t *)g_scheduler_exe_time,
			 STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_SIZE);

    /* Read demand period settings */
    EPR_Read(STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_ADDR, (uint8_t *)&g_demand_integration_period, sizeof(g_demand_integration_period));
    EPR_Read(STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_ADDR, (uint8_t *)&g_demand_number_of_period, sizeof(g_demand_number_of_period));
	return STORAGE_OK;
}

/******************************************************************************
* Function Name : R_SCHEDULER_Restore
* Interface     : uint8_t R_SCHEDULER_Restore(void)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t	R_SCHEDULER_RestoreByID(uint8_t schedule_id)
{
	uint8_t i = 0;
	uint8_t j = 0;
    scheduler_storage_t schedule_backup = { 0, 0, 0};
	
	for (i = 0; i < MAX_SCHEDULER_NUMBER; i++)
	{
		/* Read data of scheduler to EEPROM */
		EPR_Read(STORAGE_EEPROM_SCHEDULER_DATA_ADDR + i*SCHEDULER_STORAGE_SIZE, (uint8_t *)&schedule_backup, SCHEDULER_STORAGE_SIZE);
        COPY_BACKUP_DATA(g_scheduler[i], schedule_backup);
	}
	/* Check pointer of execution time */
	if (g_scheduler[schedule_id].p_execution_time == NULL)
	{
		return STORAGE_ERROR;
	}
	else
	{
	}
	/* Read execution time slots to EEPROM */
	EPR_Read(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR + g_exe_time_base_index[schedule_id] * sizeof(r_scheduler_datetime_t),
			 (uint8_t *)g_scheduler[schedule_id].p_execution_time,
			  sizeof(r_scheduler_datetime_t) * scheduler_exe_time_maximum_support[schedule_id]);

	return STORAGE_OK;
}
/******************************************************************************
* Function Name : R_SCHEDULER_Format
* Interface     : void R_SCHEDULER_Format(
*               :     void
*               : );
* Description   : format data, write default data to storage.
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
uint8_t R_SCHEDULER_Format(void)
{
    uint8_t i = 0;
	uint8_t j = 0;
	scheduler_storage_t write_default_scheduler;
	uint8_t default_number_exe_time[MAX_SCHEDULER_NUMBER] = {8, 0, 0, 1, 0, 0};
    uint16_t default_demand_integration_period = SCHEDULER_DEFAULT_MAX_DEMAND_PERIOD;
    uint16_t default_demand_number_of_period = SCHEDULER_DEFAULT_MAX_DEMAND_NUM_OF_PERIOD;

