Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES - Copy/01.Source/rl78i1c/application/scheduler/r_scheduler.c
	/* Write default value for billing scheduler */
	for (i = 0; i < MAX_SCHEDULER_NUMBER; i++)
	{
		/* Write default value for tariff scheduler */
		write_default_scheduler.number_of_exe_time = default_number_exe_time[i];
		write_default_scheduler.matched = FALSE;
		write_default_scheduler.script_id = i + 1;
		EPR_Write(STORAGE_EEPROM_SCHEDULER_DATA_ADDR + i*SCHEDULER_STORAGE_SIZE, (uint8_t *)&write_default_scheduler, SCHEDULER_STORAGE_SIZE);

		//Write execution time slots to EEPROM
		for (j = 0; j < default_number_exe_time[i]; j++)
		{
			switch (i)
			{
			case 0://index of tariff
				EPR_Write(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR + (g_exe_time_base_index[i] + j) * sizeof(r_scheduler_datetime_t),
						  (uint8_t *)&tariff_exe_time_default[j],
						  sizeof(r_scheduler_datetime_t));
				break;
			case 3://index of billing
				EPR_Write(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR + (g_exe_time_base_index[i] + j) * sizeof(r_scheduler_datetime_t),
						  (uint8_t *)&billing_schedule_default,
						  sizeof(r_scheduler_datetime_t));
				break;
			default://remaining
				EPR_Write(STORAGE_EEPROM_SCHEDULER_SAS_DATE_TIME_ADDR + (g_exe_time_base_index[i] + j) * sizeof(r_scheduler_datetime_t),
						  (uint8_t *)&common_schedule_default,
						  sizeof(r_scheduler_datetime_t));
				break;
			}
		}
	}
    /* Write default demand period settings */
    EPR_Write(STORAGE_EEPROM_SCHEDULER_DEMAND_INTEGRATION_PERIOD_ADDR, (uint8_t *)&default_demand_integration_period, sizeof(default_demand_integration_period));
    EPR_Write(STORAGE_EEPROM_SCHEDULER_DEMAND_NUMBER_OF_PERIOD_ADDR, (uint8_t *)&default_demand_number_of_period, sizeof(default_demand_number_of_period));
	
    return STORAGE_OK;
}

/******************************************************************************
* Function Name : R_SCHEDULER_ExecutionTimeArrayLengthGet
* Interface     : int16_t R_SCHEDULER_ExecutionTimeArrayLengthGet(uint8_t schedule_id)
* Description   :
* Arguments     :
* Return Value  : int16_t
******************************************************************************/
int16_t R_SCHEDULER_ExecutionTimeArrayLengthGet(uint8_t schedule_id)
{
	if (schedule_id >= MAX_SCHEDULER_NUMBER)
	{
		return -1;
	}
	return g_scheduler[schedule_id].number_of_exe_time;
}

/******************************************************************************
* Function Name : R_SCHEDULER_ExecutionTimeArrayLengthSet
* Interface     : uint8_t R_SCHEDULER_ExecutionTimeArrayLengthSet(uint8_t schedule_id, uint16_t length)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_SCHEDULER_ExecutionTimeArrayLengthSet(uint8_t schedule_id, uint16_t length)
{
	if ((schedule_id >= MAX_SCHEDULER_NUMBER) || (length > scheduler_exe_time_maximum_support[schedule_id]))
	{
		return FALSE;
	}
	g_scheduler[schedule_id].number_of_exe_time = length;
	
	return TRUE;
}

/******************************************************************************
* Function Name : R_SCHEDULER_ExecutionTimeGet
* Interface     : uint8_t R_SCHEDULER_ExecutionTimeGet(uint8_t * p_data_out, uint8_t schedule_id,  uint16_t array_index)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_SCHEDULER_ExecutionTimeGet(uint8_t * p_data_out, uint8_t schedule_id,  uint16_t array_index)
{
	if (schedule_id >= MAX_SCHEDULER_NUMBER)
	{
		return FALSE;
	}

	p_data_out[0] = g_scheduler[schedule_id].p_execution_time[array_index].Hour;
	p_data_out[1] = g_scheduler[schedule_id].p_execution_time[array_index].Min;
	p_data_out[2] = g_scheduler[schedule_id].p_execution_time[array_index].Sec;

	return TRUE;
}

/******************************************************************************
* Function Name : R_SCHEDULER_ExecutionTimeSet
* Interface     : uint8_t R_SCHEDULER_ExecutionTimeSet(uint8_t * p_data_in, uint8_t schedule_id,  uint16_t array_index)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_SCHEDULER_ExecutionTimeSet(uint8_t * p_data_in, uint8_t schedule_id,  uint16_t array_index)
{
	if (schedule_id >= MAX_SCHEDULER_NUMBER)
	{
		return FALSE;
	}
	g_scheduler[schedule_id].p_execution_time[array_index].Hour = p_data_in[0];
	g_scheduler[schedule_id].p_execution_time[array_index].Min  = p_data_in[1];
	g_scheduler[schedule_id].p_execution_time[array_index].Sec  = p_data_in[2];

	return TRUE;
}

/******************************************************************************
* Function Name : R_SCHEDULER_ExecutionDateGet
* Interface     : uint8_t R_SCHEDULER_ExecutionDateGet(uint8_t * p_data_out, uint8_t schedule_id,  uint16_t array_index)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_SCHEDULER_ExecutionDateGet(uint8_t * p_data_out, uint8_t schedule_id,  uint16_t array_index)
{
	if (schedule_id >= MAX_SCHEDULER_NUMBER)
	{
		return FALSE;
	}
	
	p_data_out[0] = g_scheduler[schedule_id].p_execution_time[array_index].Year;
	p_data_out[1] = g_scheduler[schedule_id].p_execution_time[array_index].Month;
	p_data_out[2] = g_scheduler[schedule_id].p_execution_time[array_index].Week;
	p_data_out[3] = g_scheduler[schedule_id].p_execution_time[array_index].Day;
	
	return TRUE;
}

/******************************************************************************
* Function Name : R_SCHEDULER_ExecutionDateSet
* Interface     : uint8_t R_SCHEDULER_ExecutionDateSet(uint8_t * p_data_in, uint8_t schedule_id,  uint16_t array_index)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_SCHEDULER_ExecutionDateSet(uint8_t * p_data_in, uint8_t schedule_id,  uint16_t array_index)
{
	if (schedule_id >= MAX_SCHEDULER_NUMBER)
	{
		return FALSE;
	}
	
	g_scheduler[schedule_id].p_execution_time[array_index].Year  = p_data_in[0];
	g_scheduler[schedule_id].p_execution_time[array_index].Month = p_data_in[1];
	g_scheduler[schedule_id].p_execution_time[array_index].Week  = p_data_in[2];
	g_scheduler[schedule_id].p_execution_time[array_index].Day   = p_data_in[3];
	
	return TRUE;
}
